import { MenuProps } from "antd";

type MenuItem = Required<MenuProps>["items"][number];

export const MenuListItems: MenuItem[] = [
  {
    label: "Отдел продаж",
    key: "sub1",
    children: [
      {
        key: "1-1",
        label: "Директор Нурмиев Р.Т.",
        type: "group",
        children: [
          { key: "1", label: "Офис, координаторы" },
          { key: "2", label: "Зам. начальника отдела продаж" },
          { key: "3", label: "Начальник отдела продаж Н.Челны " },
          { key: "4", label: "ОП: Дорожно-строительная техника Н. Челны" },
          { key: "5", label: "Директор по маркетингу" },
          {
            key: "6",
            label: "Начальник отдела по работе с лизинговыми компаниями",
          },
          {
            key: "7",
            label: "Заместитель директора - начальник тендерного отдела",
          },
          { key: "8", label: "Отдел контроля контрагентов" },
        ],
      },
      {
        key: "1-2",
        label: "Директоры департаментов продаж",
        type: "group",
        children: [
          {
            key: "9",
            label: "г. Екатеринбург ",
          },
          { key: "10", label: "г. Казань" },
          { key: "11", label: "г. Уфа" },
          {
            key: "12",
            label: "г. Санкт-Петербург",
          },
          {
            key: "13",
            label: "г. Нижний Новгород",
          },
          {
            key: "14",
            label: "Сибири и Дальнему Востоку",
          },
          {
            key: "15",
            label: "г. Краснодар",
          },
          {
            key: "16",
            label: "г. Пермь",
          },
          {
            key: "17",
            label: "г. Челябинск",
          },
          {
            key: "18",
            label: "г. Самара",
          },
          {
            key: "19",
            label: "г. Москва",
          },
        ],
      },
    ],
  },
  // {
  //   key: "sub2",
  //   label: "Департамент",
  //   children: [
  //     { key: "5", label: "Option 5" },
  //     { key: "6", label: "Option 6" },
  //     {
  //       key: "sub3",
  //       label: "Submenu",
  //       children: [
  //         { key: "7", label: "Option 7" },
  //         { key: "8", label: "Option 8" },
  //       ],
  //     },
  //   ],
  // },
  {
    key: "sub4",
    label: "ОК",
    children: [
      {
        key: "2-1",
        label: "Заместитель директора по работе с персоналом Червина Л.А.",
        type: "group",
        children: [
          { key: "20", label: "Отдел кадров" },
          { key: "21", label: "Отдел обучения и развития персонала" },
          { key: "323", label: "Отдел труда и заработной платы" },
          { key: "333", label: "Отдел подбора персонала" },
          { key: "5342", label: "Секретариат, водители" },
        ],
      },
    ],
  },
  {
    key: "sub5",
    label: "Маркетинг",
    children: [
      {
        key: "3-1",
        label: "Директор по маркетингу Сауэрмильх А.А.",
        type: "group",
        children: [
          {
            key: "13421",
            label: "Заместитель директора по маркетингу Мокеева А.О.",
            type: "group",
            children: [
              {
                key: "1143143",
                label: "Отдел маркетинга и рекламы в г.Набережные Челны",
              },
              {
                key: "32412",
                label: "Отдел маркетинга и рекламы в г.Казань",
                children: [
                  {
                    key: "11234",
                    label:
                      "Ведущий специалист по маркетингу и рекламе в г.Казань",
                    children: [
                      {
                        key: "23413451",
                        label: "Операторы CaII - центра",
                      },
                    ],
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    key: "sub6",
    label: "ВЭД",
    children: [
      {
        key: "1714513",
        label: "Директор по логистике Шайхзадин Р.Р.",
        type: "group",
      },
      {
        key: "13512348",
        label: "Группа ВЭД Валл К.А.",
      },
      { key: "1454359", label: "Группа транспортной логистики Гильфанов Р.З." },
    ],
  },
  {
    key: "sub7",
    label: "СБ",
    children: [
      {
        key: "21251251",
        label: "Начальник службы безопасности Ахмадеев М.Л.",
        type: "group",
        children: [
          {
            key: "16574357",
            label: "Охрана Складской комплекс",
          },
          {
            key: "134514518",
            label: "Охрана База",
          },
        ],
      },
    ],
  },
  {
    key: "sub8",
    label: "Эконом.отдел",
    children: [
      {
        key: "25625",
        label: "Директор по управленческому учету",
        type: "group",
        children: [{ key: "2565", label: "Экономический отдел" }],
      },
    ],
  },
  {
    key: "sub9",
    label: "Сервис",
    children: [
      {
        key: "2325",
        label: "Директор по сервису Муллахметов И.Э.",
        type: "group",
        children: [
          { key: "265675", label: "Технический отдел  Валиев Н.Н." },
          { key: "65725", label: "Отдел аренды Хакимуллин Р.Х." },
          {
            key: "2373655",
            label: "Заместитель директора по сервису Тодоров А.М.",
            children: [
              {
                key: "23475",
                label:
                  "Сервисные службы департаментов продаж (12 руководителей СС)",
                children: [
                  {
                    key: "245265",
                    label: "ОП: Сервис ДП",
                  },
                  {
                    key: "9025",
                    label: "Выездной сервис",
                  },
                  {
                    key: "276895",
                    label: "Стационарный сервис",
                  },
                ],
              },
            ],
          },
          { key: "28955", label: "Отдел гарантии и качества Морозов А.С." },
          { key: "25569678", label: "Отдел по сопровождению проектов" },
        ],
      },
    ],
  },
  {
    key: "sub10",
    label: "IТ",
    children: [
      {
        key: "367983",
        label: "Директор ИT - направления Нюньков Г.Ю.",
        type: "group",
        children: [
          { key: "34567569", label: "Группа разработки Поливин А.Н." },
          {
            key: "56965735",
            label: "Группа информационного сопровождения Капалыгина Д.А.",
          },
          { key: "3679566", label: "Группа бизнес - аналитики" },
          {
            key: "356956",
            label: "Заместитель директора ИT - направления Гатин В.Р.",
          },
          {
            key: "35678656",
            label:
              "Группа системного администрирования и тех. поддержки Ибрагимов И.Р.",
          },
          { key: "36569865", label: "Группа эксплуатации инфраструктуры" },
        ],
      },
    ],
  },
  {
    key: "sub11",
    label: "Склад",
    children: [
      {
        key: "3478677",
        label:
          "Заместитель директора по складскому хозяйству Салахутдинова Г.К.",
        type: "group",
        children: [
          {
            key: "384786479",
            type: "group",
            label:
              "Заместитель руководителя складского хозяйства - Склад г.Набережные Челны Савельев А.П.",
            children: [
              { key: "34874848", label: "Департамент 'Круглое поле' запчасти" },
              { key: "394867", label: "Склад шин Круглое Поле" },
              { key: "447987950", label: "Склад Техники Круглое поле (Новое)" },
              { key: "4487690", label: "Склад Наб.Челны" },
            ],
          },
          {
            key: "3478649",
            label: "Руководитель складского хозяйства Круглый В.В.",
          },
          { key: "44679650", label: "Склады Департаментов продаж (11)" },
        ],
      },
    ],
  },
  {
    key: "sub12",
    label: "ТБ",
    children: [
      {
        key: "876441",
        label: "Начальник отдела охраны труда Миннеханов И.М.",
        type: "group",
        children: [
          {
            key: "347846789",
            label: "Отдел охраны труда (Специалист по охране труда)",
          },
        ],
      },
    ],
  },
  {
    key: "sub13",
    label: "Бухгалтерия",
    children: [
      {
        key: "446786492",
        label:
          "Заместитель директора по экономике и финансам Багаутдинова О.Т.",
        type: "group",
        children: [
          { key: "43487764", label: "Главный бухгалтер ТРР Земскова О.Ю." },
          { key: "43478463", label: "Главный бухгалтер ТР Логунова Р.А." },
          {
            key: "43876463",
            label: "Главный бухгалтер Позитив, Спецтехника Ушакова Н.Б.",
          },
        ],
      },
    ],
  },
  {
    key: "sub14",
    label: "Юр.отдел",
    children: [
      {
        key: "4484833",
        label:
          "Заместитель директора по юридическому сопровождению Багаутдинова Д.Р.",
        type: "group",
        children: [{ key: "44", label: "Юридическая служба" }],
      },
    ],
  },
  {
    key: "sub15",
    label: "Тендер.отдел",
    children: [
      {
        key: "434325234",
        label:
          "Заместитель директора - начальник тендерного отдела Тимкин М.А.",
        type: "group",
        children: [{ key: "44325234", label: "Тендерный отдел" }],
      },
    ],
  },
  {
    key: "sub16",
    label: "АКБ",
    children: [
      {
        key: "4246893",
        label: "Бренд-менеджер (направление  АКБ) Червин С.Н.",
      },
    ],
  },
  // {
  //   key: "sub17",
  //   label: "Зап.части",
  //   children: [{ key: "46", label: "Option 9" }],
  // },
  // {
  //   key: "sub18",
  //   label: "Шины",
  //   children: [{ key: "47", label: "Option 9" }],
  // },
  // {
  //   key: "sub19",
  //   label: "Вилочная",
  //   children: [{ key: "48", label: "Option 9" }],
  // },
  // {
  //   key: "sub20",
  //   label: "ДСТ",
  //   children: [{ key: "49", label: "Option 9" }],
  // },
  // {
  //   key: "sub21",
  //   label: "Техника для склада",
  //   children: [{ key: "50", label: "Option 9" }],
  // },
];
